#+TITLE: 0685. Redundant Connection II
#+DATE: 2020-09-18 12:09
#+LAST_MODIFIED: 2020-09-18 12:09
#+STARTUP: overview
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
#+EXPORT_FILE_NAME: 0685-redundant-connection-ii
#+HUGO_BASE_DIR:~/G/blog
#+HUGO_SECTION: leetcode
#+HUGO_CATEGORIES:leetcode
#+HUGO_TAGS: Leetcode Algorithms Tree DepthfirstSearch UnionFind Graph

*** Python

#+BEGIN_SRC python :exports both :results output
class UnionFind(object):
    def __init__(self, n):
        self.pre = list(range(n))

    def find(self, x):
        if x != self.pre[x]:
            self.pre[x] = self.find(self.pre[x])
        return self.pre[x]

    def union(self, x1, x2):
        root1 = self.find(x1)
        root2 = self.find(x2)
        if root1 != root2:
            self.pre[root2] = root1
            return False

        return True


class Solution(object):
    def findRedundantDirectedConnection(self, edges):
        n = len(edges)
        uf = UnionFind(n + 1)

        last = []
        parent = {}
        candidates = []
        for st, ed in edges:
            if ed in parent:
                candidates.append([parent[ed], ed])
                candidates.append([st, ed])
            else:
                parent[ed] = st
                if uf.union(st, ed):
                    last = [st, ed]

        if not candidates:
            return last

        return candidates[0] if last else candidates[1]


if __name__ == "__main__":

    e1 = [[1, 2], [2, 3], [3, 1]]
    e2 = [[1, 2], [2, 3], [3, 1], [4, 2]]
    e3 = [[1, 2], [1, 3], [2, 3]]

    # print(Solution().findRedundantDirectedConnection(e1))
    print(Solution().findRedundantDirectedConnection(e2))
    print(Solution().findRedundantDirectedConnection(e3))
#+END_SRC

#+RESULTS:
#+begin_example
1 2 [0, 1, 1, 3, 4]
2 3 [0, 1, 1, 1, 4]
3 1 [0, 1, 1, 1, 4]
last:  [3, 1]
[0, 1, 1, 1, 4]
[1, 2]
1 2 [0, 1, 1, 3]
1 3 [0, 1, 1, 1]
[0, 1, 1, 1]
[2, 3]
#+end_example

